In [1]:
import numpy as np
import pandas as pd

/var/folders/31/m46t9hpx2kq8y89bx7jdb8l00000gn/T/ipykernel_69548/1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.read_csv("./Data/Dataserts/supermarket_sales.csv")
df.head(3)

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4

<h5>
    01. Qual o faturamento total por filial?
</h5>

In [3]:
df.groupby("Branch")["Total"].sum()

Branch
A    106200.3705
B    106197.6720
C    110568.7065
Name: Total, dtype: float64

<h5>
    02. Qual a percentual de participação na receita de cada tipo de produto?
</h5>

In [4]:
(df.groupby("Product line")["Total"].sum() / df.groupby("Product line")["Total"].sum().sum()).sort_values()*100

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

<h5>
    03. Como está distribuído o tipo de produto consumido por
</h5>

In [5]:
df.groupby(["Product line", "Gender"])[["Total"]].sum().pivot_table(index="Product line", columns="Gender")

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

<h5>
    04. Qual foi o faturamento por mês?
</h5>

In [6]:
df['Date'] = pd.to_datetime(df["Date"])
df['Month'] = df['Date'].apply(lambda x: x.month)
df['Year'] = df['Date'].apply(lambda x: x.year)

In [7]:
df.groupby(['Month'])['Total'].sum()

Month
1    116291.868
2     97219.374
3    109455.507
Name: Total, dtype: float64

<h5>
    05. Qual foi a média de avaliação por cada filial em janeiro de 2019?
</h5>

In [8]:
df[(df["Year"] == 2019) & (df["Month"] == 1)]['Rating'].mean()

7.017613636363635

<h5>
    06. Como se distribui o gasto por tipo de consumidor em cada filial?
</h5>

In [9]:
df.groupby(["Customer type", "City"])["Total"].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [4]:
df.memory_usage()

Index    128
col1      32
col2      32
col3      32
dtype: int64

In [5]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [7]:
df['col2'].unique()

array([444, 555, 666])

In [8]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [11]:
df['col1 ** 2'] = df['col1'].apply(lambda x: x*2)

In [12]:
df

   col1  col2 col3  col1 ** 2
0     1   444  abc          2
1     2   555  def          4
2     3   666  ghi          6
3     4   444  xyz          8

In [13]:
df['col1'].idxmax() #Qual o indice do valor maximo

3

In [17]:
df[df['col2'] == 444]

   col1  col2 col3  col1 ** 2
0     1   444  abc          2
3     4   444  xyz          8

In [18]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [19]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [20]:
dic_map = {'one':1, 'two':2}

In [23]:
df['E'] = df['B'].map(dic_map)

In [24]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [25]:
df.pivot_table(index='A', columns='B', values='D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0